sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck_hw.c
//===========================================================
// INCLUDES
//===========================================================
#include <xc.h>
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include "nora_dma.h"               // CK DMA channel config/enable
#include "nora_spi_i2s_tdm_dspic33ck_reg.h"   // CK SPI framed-mode register masks (L/H split)
#include "nora_spi_i2s_tdm_dspic33ck_hw.h"


//===========================================================
// Definition
//===========================================================

// ---- Debug master switch (silicon layer) ----
//#define ENA_TDM_DBG
#if defined(ENA_TDM_DBG)
  #include <stdio.h>
  #define TDM_DBG_PRINTF(...)   printf(__VA_ARGS__)
#else
  #define TDM_DBG_PRINTF(...)   ((void)0)
#endif

#define PRIO_TDM_DMA              (4)

/*
 * The DMA trigger a leg needs is now named as a peripheral leg (nora_dma_trigger_t),
 * not transcribed as a register code. This file used to hold the CHSEL numbers from
 * "TABLE 10-1: DMA CHANNEL TRIGGER SOURCES"; they moved to dma_trigger_to_chsel() in
 * src/hal_dma/nora_dma_dspic33ck.c, which is the single place that encoding lives and
 * also the place that refuses SPI3 on a device that has none.
 *
 * That comment is worth following before assuming this was cosmetic: CHSEL is NOT the
 * CPU interrupt vector number, and conflating the two was this transport's actual
 * first-silicon failure on both devices -- a transport that configured perfectly,
 * reported success, and moved zero elements. Naming the leg instead of the number is
 * what makes that failure unreachable from here.
 */


//===========================================================
// Enum & Struct typedef (silicon facts)
//===========================================================
/*
 * There is deliberately no CPU-IRQ descriptor here.
 *
 * A `{ &IECn, mask, &IFSn, mask }` row per instance is the shape this HAL used to carry,
 * and it cannot be written one bit at a time: with the register in a pointer and the bit
 * in a runtime mask the compiler has to build the whole word -- load, or/and, store. IFSx
 * and IECx are shared by every peripheral on the part, so that store puts back whatever
 * the word held at the load. On EV88G73A IEC0 holds the 1 ms tick, both audio DMA legs,
 * the load-monitor time base, SPI1 RX/TX and the console UART all together, so there is
 * no such thing as touching "the SPI's interrupt bit" there.
 *
 * The CPU flags are therefore written through the DFP bit aliases (`_SPI1RXIE`) with a
 * literal value, in hw_spi_irq_bits_enable() / hw_spi_irq_bits_clear_flags() below, which
 * compiles to a single bset.b/bclr.b. That also removes the per-part bank knowledge the
 * table used to carry (SPI1 in IFS0, SPI2 in IFS1, SPI3 in IFS3): the alias names the bit
 * wherever the DFP puts it.
 */

// CK SPI control registers are split into 16-bit L/H halves.
typedef struct {
    volatile void     *spi_buf;     // &SPIxBUFL (16-bit DMA data port)
    volatile uint16_t *con1l;       // &SPIxCON1L (MSTEN/MODE32/SPIFE/CKP/CKE/MCLKEN/ENHBUF/SPIEN)
    volatile uint16_t *con1h;       // &SPIxCON1H (FRMEN/FRMCNT/FRMSYPW/FRMPOL/FRMSYNC/AUDEN/IGNROV/IGNTUR)
    volatile uint16_t *con2l;       // &SPIxCON2L (WLENGTH)
    volatile uint16_t *brgl;        // &SPIxBRGL
    volatile uint16_t *imskl;       // &SPIxIMSKL (event->DMA enables)
    volatile uint16_t *statl;       // &SPIxSTATL (SPIROV/SPITUR/FRMERR framed-transport health)
    // Which peripheral leg fires the DMA channel. A logical trigger, not a register
    // code -- the DMA backend maps and validates it.
    nora_dma_trigger_t rx_trigger;  // DMA trigger for SPIxRX
    nora_dma_trigger_t tx_trigger;  // DMA trigger for SPIxTX
    // CPU RX/TX interrupt flag and enable bits are NOT here -- see the note above.
} tdm_spi_dev_t;


//===========================================================
// Function Prototype (private)
//===========================================================
static bool hw_inst_valid( tdm_spi_inst_t inst );
static bool hw_dma_config_channel( tdm_spi_inst_t inst, nora_dma_channel_t dma_ch, nora_tdm_slot_t *buffer, uint32_t count, bool is_rx );
static void hw_spi_irq_enable( tdm_spi_inst_t inst, bool enable );
static void hw_spi_irq_disable_clear( tdm_spi_inst_t inst );
static void hw_spi_irq_bits_enable( tdm_spi_inst_t inst, bool enable );
static void hw_spi_irq_bits_clear_flags( tdm_spi_inst_t inst );


//===========================================================
// Variables
//===========================================================

// DEVICE FACTS - data sheet transcription only. Indexed by tdm_spi_inst_t.
// No interrupt-adjacent register number remains in this table: the DMA trigger is now a
// logical leg (see the note above), and the CPU RX/TX flag and enable bits live in
// hw_spi_irq_bits_*() as DFP aliases.
static const tdm_spi_dev_t s_spi_dev[TDM_SPI_INST_COUNT] =
{
    [TDM_SPI1] =
    {
        (volatile void *)&SPI1BUFL, &SPI1CON1L, &SPI1CON1H, &SPI1CON2L, &SPI1BRGL, &SPI1IMSKL,
        &SPI1STATL,
        NORA_DMA_TRIGGER_SPI1_RX, NORA_DMA_TRIGGER_SPI1_TX,
    },
    [TDM_SPI2] =
    {
        (volatile void *)&SPI2BUFL, &SPI2CON1L, &SPI2CON1H, &SPI2CON2L, &SPI2BRGL, &SPI2IMSKL,
        &SPI2STATL,
        NORA_DMA_TRIGGER_SPI2_RX, NORA_DMA_TRIGGER_SPI2_TX,
    },
#if defined(SPI3CON1L)
    [TDM_SPI3] =
    {
        (volatile void *)&SPI3BUFL, &SPI3CON1L, &SPI3CON1H, &SPI3CON2L, &SPI3BRGL, &SPI3IMSKL,
        &SPI3STATL,
        NORA_DMA_TRIGGER_SPI3_RX, NORA_DMA_TRIGGER_SPI3_TX,
    },
#else
    // No SPI3 on this device (e.g. dsPIC33CK64MC105). Left zeroed: a leg never
    // targets TDM_SPI3 unless the core's leg table puts one there, so this row
    // is dead, not just unpopulated. Zero is NORA_DMA_TRIGGER_NONE, so even if a
    // leg reached it the channel would be software-only rather than armed against
    // whatever code happened to be zero.
    [TDM_SPI3] = { 0 },
#endif
};


//===========================================================
// Global Function (silicon operations)
//===========================================================

