sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck_hw.c
/*
 * Program CK SPI framed-mode registers for one physical SPI instance. Writes
 * SPIxCON1L/CON1H/CON2L/BRGL from the validated config, AUDEN off (framed SPI + DMA,
 * not audio mode), leaving DMA-trigger events + the module OFF.
 */
void nora_spi_i2s_tdm_hw_apply_config( tdm_spi_inst_t inst,
                                            const nora_spi_i2s_tdm_config_t* cfg )
{
    if( !hw_inst_valid( inst ) || ( cfg == NULL ) )
    {
        return;
    }

    const tdm_spi_dev_t *dev = &s_spi_dev[inst];
    volatile uint16_t *con1l = dev->con1l;
    volatile uint16_t *con1h = dev->con1h;

    *con1l = 0;    // module OFF; SPIEN last
    *con1h = 0;

    // ---- CON1H: framed SPI, audio mode off ----
    nora_spi_i2s_tdm_reg_clear16(con1h, NORA_SPI_I2S_TDM_CON1H_AUDEN);   // AUDEN=0 : framed SPI, not audio mode
    nora_spi_i2s_tdm_reg_set16  (con1h, NORA_SPI_I2S_TDM_CON1H_FRMEN);   // FRMEN=1 : framed SPI (SSx = FSYNC)

    // FS waveform shape -> FRMSYPW (pulse width) + fs_words (FRMCNT cadence).
    const bool fs_50pct  = ( cfg->fs_shape == NORA_SPI_I2S_TDM_FS_50PCT );
    const bool is_i2s    = ( cfg->format   == NORA_SPI_I2S_TDM_FORMAT_I2S );
    const bool is_master = ( cfg->clock_role     == NORA_SPI_I2S_TDM_CLOCK_MASTER );
    bool    frmsypw;
    uint8_t fs_words;
    if( fs_50pct && is_i2s )
    {
        // FRMSYPW=1 = one WIRE WORD wide = 16 BCLK, which is 25% of a 64-BCLK (2 x 32-bit)
        // I2S frame, NOT 50% -- MODE16 (defect 5) took that away. This path is therefore
        // only reachable as a SLAVE, where FS is an input and FRMSYPW describes how the
        // incoming FS is read: configure() rejects I2S + MASTER + FS_50PCT precisely so no
        // caller gets a 25% waveform in answer to a 50% request (tdm_config_is_supported).
        frmsypw  = true;
        fs_words = cfg->slots_per_fs;
    }
    else if( fs_50pct && is_master )           // FS_50PCT + TDM MASTER: half-frame marker (CLC, Stage 2)
    {
        frmsypw  = false;
        fs_words = (uint8_t)(cfg->slots_per_fs / 2u);
    }
    else                                       // FS_PULSE, or ANY slave (FS is an input)
    {
        frmsypw  = false;
        fs_words = cfg->slots_per_fs;
    }
    nora_spi_i2s_tdm_reg_set_or_clear16(con1h, NORA_SPI_I2S_TDM_CON1H_FRMSYPW, frmsypw);

    // IGNROV + IGNTUR are HAL POLICY, not a config field (they left config_t with the
    // canonical alignment). Continuous DMA audio keeps both SET so a secondary FIFO error
    // cannot critical-stop the SPI leg and mask the primary failure; the errors are still
    // OBSERVED and counted every block (err_rov_block_count / err_tur_block_count via
    // SPIxSTATL) and RX request overrun is reported separately from DMAINTn.OVRUNIF. This is
    // containment, NOT a claim that data loss is benign. Both existing callers already
    // passed true for both, so this is byte-identical behaviour to the field version.
    nora_spi_i2s_tdm_reg_set16(con1h, NORA_SPI_I2S_TDM_CON1H_IGNROV);
    nora_spi_i2s_tdm_reg_set16(con1h, NORA_SPI_I2S_TDM_CON1H_IGNTUR);

    // FRMPOL: 1 = FS active-high (TDM), 0 = active-low (I2S).
    nora_spi_i2s_tdm_reg_set_or_clear16(con1h, NORA_SPI_I2S_TDM_CON1H_FRMPOL,
                                     cfg->format != NORA_SPI_I2S_TDM_FORMAT_I2S);

    if( is_master )
    {
        // FRMSYNC=0 : FS output (host). MSTEN set in CON1L below.
        nora_spi_i2s_tdm_reg_clear16(con1h, NORA_SPI_I2S_TDM_CON1H_FRMSYNC);
    }
    else
    {
        nora_spi_i2s_tdm_reg_set16(con1h, NORA_SPI_I2S_TDM_CON1H_FRMSYNC);   // FS input (client)
    }

    // FRMCNT counts SERIAL WIRE WORDS between frame syncs, not audio slots. The serial
    // word is 16 bits (MODE16, below) while an audio slot is 32, so ONE SLOT IS TWO WIRE
    // WORDS and fs_words -- computed above in slots -- has to be scaled before it can be
    // encoded. This is why TDM8/32-bit is FRMCNT=4 (log2(16)) and not 3 (log2(8)); getting
    // it wrong puts FS in the middle of a slot, which is precisely the failure the stage B
    // harness (boards/ev88g73a/ev88g73a_spi_dma_min.c, since deleted) was built
    // to detect. What it found is in the CK silicon findings note:
    // https://github.com/sulaolab/dspic33ck-hal-lab/blob/main/docs/ck_silicon_findings.md
    const uint16_t wire_words_per_slot = (uint16_t)((cfg->word_bits + 15u) / 16u);
    const uint16_t fs_wire_words       = (uint16_t)fs_words * wire_words_per_slot;

    // FRMCNT: FS every N wire words, encoding = log2(N).
    uint16_t frmcnt;
    switch( fs_wire_words )
    {
    case 1u:  frmcnt = 0u; break;
    case 2u:  frmcnt = 1u; break;
    case 4u:  frmcnt = 2u; break;
    case 8u:  frmcnt = 3u; break;
    case 16u: frmcnt = 4u; break;
    case 32u: frmcnt = 5u; break;
    default:
        // Unreachable through configure(): tdm_config_is_supported() bounds slots_per_fs
        // so that fs_wire_words is always a power of two in 1..32. If it is reached
        // anyway, FRMEN is CLEARED rather than a plausible-looking FRMCNT written -- an
        // unframed stream is obviously broken, a mis-framed one looks like it works. (The
        // old code silently substituted the TDM8 value here, which is the shape of every
        // defect in the CK silicon findings note:
        // https://github.com/sulaolab/dspic33ck-hal-lab/blob/main/docs/ck_silicon_findings.md)
        TDM_DBG_PRINTF(" ERROR: %u wire words/FS is not FRMCNT-encodable; framing OFF.\n",
                       (unsigned)fs_wire_words);
        nora_spi_i2s_tdm_reg_clear16(con1h, NORA_SPI_I2S_TDM_CON1H_FRMEN);
        frmcnt = 0u;
        break;
    }
    nora_spi_i2s_tdm_reg_write_field16(con1h, NORA_SPI_I2S_TDM_CON1H_FRMCNT_MASK,
                                    NORA_SPI_I2S_TDM_CON1H_FRMCNT_POS, frmcnt);

    // ---- CON2L: WLENGTH must be 0 when MODE16/MODE32 select the transfer width ----
    // SPI FRM DS70005136: "when WLENGTH is N, MODE32 and MODE16 should be zero" -- the two
    // are alternative ways to set the word size, not complementary. The transfer unit here
    // is chosen by MODE16 below, so WLENGTH is 0. (It previously wrote word_bits-1 = 31
    // WHILE also setting MODE32, i.e. both mechanisms at once.)
    nora_spi_i2s_tdm_reg_write_field16(dev->con2l, NORA_SPI_I2S_TDM_CON2L_WLENGTH_MASK,
                                    NORA_SPI_I2S_TDM_CON2L_WLENGTH_POS, 0u);

