sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck_hw.c
    // ---- CON1L: element width, buffering, clock/role ----
    //
    // ENHBUF = 0 (audit defect 4). SPI FRM DS70005136, SPIxCON1L note 5: Standard Buffer
    // mode is the ONLY mode permitted with DMA. In Enhanced Buffer mode SPIRBF/SPITBE mean
    // "FIFO endpoint reached" rather than "one element moved", so the DMA trigger no longer
    // corresponds to one transfer.
    nora_spi_i2s_tdm_reg_clear16(con1l, NORA_SPI_I2S_TDM_CON1L_ENHBUF);
    // MODE16 = 1 / MODE32 = 0 (audit defect 5). A 32-bit slot cannot be fed through
    // SPIxBUFL alone: the 32-bit FIFO push is triggered by the SPIxBUFH access, and no CK
    // DMA addressing mode can alternate SPIxBUFL/SPIxBUFH while also advancing through the
    // buffer (there is no stride, and one RELOAD bit reloads SRC/DST/CNT together). So the
    // WIRE unit is 16 bits and a 32-bit slot is two wire words -- which is what the DMA
    // already does (count * 2 half-word elements; see hw_dma_config_channel).
    nora_spi_i2s_tdm_reg_clear16(con1l, NORA_SPI_I2S_TDM_CON1L_MODE32);
    nora_spi_i2s_tdm_reg_set16  (con1l, NORA_SPI_I2S_TDM_CON1L_MODE16);
    nora_spi_i2s_tdm_reg_set_or_clear16(con1l, NORA_SPI_I2S_TDM_CON1L_MCLKEN, cfg->mclk_enable);
    nora_spi_i2s_tdm_reg_set_or_clear16(con1l, NORA_SPI_I2S_TDM_CON1L_MSTEN, is_master);              // 1=host / 0=client
    // SPIFE: 1 = FS coincides with first BCLK (no delay), 0 = 1-bit delayed.
    nora_spi_i2s_tdm_reg_set_or_clear16(con1l, NORA_SPI_I2S_TDM_CON1L_SPIFE, cfg->fs_coincides_first_bclk);
    nora_spi_i2s_tdm_reg_set_or_clear16(con1l, NORA_SPI_I2S_TDM_CON1L_CKP, cfg->bclk_idle_high);
    nora_spi_i2s_tdm_reg_set_or_clear16(con1l, NORA_SPI_I2S_TDM_CON1L_CKE, cfg->bclk_change_on_active_to_idle);

    // baud rate (ignored when client / MSTEN=0). CK BRG is the low 16 bits.
    *dev->brgl = (uint16_t)(cfg->brg & 0xFFFFu);

    // Keep DMA-trigger events off until every instance is programmed; caller enables.
    nora_spi_i2s_tdm_hw_dma_trigger_enable( inst, false );

    // CPU SPI interrupts unused (DMA consumes the peripheral status flags).
    hw_spi_irq_disable_clear( inst );
}


/*
 * Configure + enable both DMA channels for one SPI instance (RX first, then TX).
 * A false return means the caller must roll back all TDM DMA/SPI state.
 */
bool nora_spi_i2s_tdm_hw_dma_config( tdm_spi_inst_t inst,
                                          nora_dma_channel_t rx_dma_ch,
                                          nora_dma_channel_t tx_dma_ch,
                                          nora_tdm_slot_t* rx_buffer,
                                          nora_tdm_slot_t* tx_buffer,
                                          uint32_t buffer_slot_count )
{
    if( !hw_inst_valid( inst ) )
    {
        return false;
    }
    if( !hw_dma_config_channel( inst, rx_dma_ch, rx_buffer, buffer_slot_count, true ) )
    {
        return false;
    }
    return hw_dma_config_channel( inst, tx_dma_ch, tx_buffer, buffer_slot_count, false );
}


/*
 * Enable/disable the SPI event->DMA triggers (SPIxIMSKL SPIRBFEN/SPITBEN), not CPU IRQs.
 */
void nora_spi_i2s_tdm_hw_dma_trigger_enable( tdm_spi_inst_t inst, bool enable )
{
    if( !hw_inst_valid( inst ) )
    {
        return;
    }

    const tdm_spi_dev_t *dev = &s_spi_dev[inst];
    const uint16_t mask = NORA_SPI_I2S_TDM_IMSKL_SPIRBFEN | NORA_SPI_I2S_TDM_IMSKL_SPITBEN;

    nora_spi_i2s_tdm_reg_set_or_clear16( dev->imskl, mask, enable );
}


/*
 * Enable/disable one SPI module (SPIxCON1L.SPIEN only).
 */
void nora_spi_i2s_tdm_hw_module_enable( tdm_spi_inst_t inst, bool enable )
{
    if( !hw_inst_valid( inst ) )
    {
        return;
    }

    const tdm_spi_dev_t *dev = &s_spi_dev[inst];
    nora_spi_i2s_tdm_reg_set_or_clear16( dev->con1l, NORA_SPI_I2S_TDM_CON1L_SPIEN, enable );
}


/*
 * Clear CPU RX/TX interrupt flags for one SPI instance.
 */
void nora_spi_i2s_tdm_hw_irq_clear_flags( tdm_spi_inst_t inst )
{
    if( !hw_inst_valid( inst ) )
    {
        return;
    }

    hw_spi_irq_bits_clear_flags( inst );
}


/*
 * Soft-stop one SPI instance: disable DMA-trigger events, mask CPU SPI IRQs, clear SPIEN.
 */
void nora_spi_i2s_tdm_hw_soft_stop( tdm_spi_inst_t inst )
{
    nora_spi_i2s_tdm_hw_dma_trigger_enable( inst, false );
    hw_spi_irq_enable( inst, false );
    nora_spi_i2s_tdm_hw_module_enable( inst, false );
}


/*
 * Resolve the one register address the ISR needs from the private silicon
 * facts table.  Deliberately keep this lookup OUT of the ISR: inst_start()
 * caches it before the DMA vector can run, then the vector uses the header
 * inline helper's exact read/W0C sequence.
 */
volatile uint16_t *nora_spi_i2s_tdm_hw_get_statl( tdm_spi_inst_t inst )
{
    if( !hw_inst_valid( inst ) )
    {
        return NULL;
    }
    return s_spi_dev[inst].statl;
}


/*
 * The PPS HAL's output enum for one SPI instance's frame-sync (SSx). Master-only
 * (used by the CLC 50%-FS module in Stage 2).
 *
 * This used to hand back the raw _RPOUT_SSxOUT code, with the per-device "OUT suffix
 * or not" #ifdef ladder here. Both are the PPS HAL's business: hal_gpio/nora_pps_dspic33ck.c
 * already carries that exact ladder for NORA_PPS_OUTPUT_SSx, so returning the enum
 * instead of the code deletes the duplicate and leaves this function doing the one thing
 * only the transport HAL knows -- which SPI instance maps to which frame-sync signal.
 */
bool nora_spi_i2s_tdm_hw_get_ss_pps_output( tdm_spi_inst_t inst,
                                                 nora_pps_output_t* output )
{
    if( output == NULL )
    {
        return false;
    }
    switch( inst )
    {
    case TDM_SPI1: *output = NORA_PPS_OUTPUT_SS1; return true;
    case TDM_SPI2: *output = NORA_PPS_OUTPUT_SS2; return true;
    case TDM_SPI3: *output = NORA_PPS_OUTPUT_SS3; return true;
    default: break;
    }
    return false;
}


//===========================================================
// Local Function
//===========================================================

static bool hw_inst_valid( tdm_spi_inst_t inst )
{
    return ( (unsigned)inst < (unsigned)TDM_SPI_INST_COUNT );
}


