sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck_hw.c
/*
 * Configure + enable one RX or TX DMA channel for a SPI instance.
 *
 * CK DMA moves 16-bit elements; a 32-bit audio slot is two DMA half-words, so the
 * element count is buffer_slot_count * 2 and the data port is SPIxBUFL. RX copies
 * SPIxBUFL -> ping-pong buffer; TX copies buffer -> SPIxBUFL. The *2 is why the buffer
 * element is a two-uint16_t wire slot rather than an int32_t -- see defect 7 below.
 *
 * This channel configuration is HARDWARE-VERIFIED (EV88G73A 2026-07-29, stages A/B/B2/C0 of
 * https://github.com/sulaolab/dspic33ck-hal-lab/blob/main/docs/ck_silicon_findings.md): 16-bit elements at SPIxBUFL, Repeated One-Shot with
 * RELOAD, HALFEN on, CPU IRQ on RX only. Notably `DONEIF` DOES set at the reload boundary
 * on this silicon despite DMA FRM DS30009742C §6.1, so HALF -> first half / DONE -> second
 * half is correct and no re-arm is needed. Verified clean at 12.5 MHz over 4000 frames.
 *
 * ---- DEFECT 7, MEASURED AND FIXED: the DMA emits the LOW half-word first ----
 * ---- (scope, EV88G73A, 2026-08-03)                                       ----
 *
 * The DMA walks the buffer in ascending address order and this core stores an int32_t
 * low-half-first (little-endian), which predicts the LOW 16 bits reach the wire first --
 * backwards from the MSB-first convention a TDM/I2S wire expects. **That prediction is what
 * actually happens.** An int32_t placed in these buffers goes out with its halves EXCHANGED.
 *
 * A loopback cannot see it (SDO->SDI returns whatever order it was given, and RX un-swaps it
 * symmetrically -- see stage B), which is why it survived this long. It matters against a
 * real codec: every sample would be half-word swapped, i.e. garbage.
 *
 * THE FIX IS IN THE BUFFER'S TYPE, not in this function. The DMA still moves 16-bit
 * elements in address order -- that is silicon, and unchangeable here. What changed is that
 * the buffers are no longer int32_t: they are nora_tdm_slot_t, whose two uint16_t
 * members are declared in WIRE order (wire[0] first). Producers convert with
 * nora_tdm_slot_encode_s32() / _decode_s32() at the point where they already store or
 * load, which measured at ~2 extra instructions per sample; `dst[i] = sample;` no longer
 * compiles. See that type's comment, and defect 7 of
 * https://github.com/sulaolab/dspic33ck-hal-lab/blob/main/docs/ck_silicon_findings.md.
 *
 * Note the acceptance test is a SCOPE reading, not the loopback: with
 * DEMO_TDM_TX_PATTERN=0xFFFF0000 the burst must open with 16 BCLK HIGH straight after FS.
 * Before the fix it opened with 16 BCLK LOW. A loopback matches either way.
 *
 * Evidence, re-runnable: app/demo_tdm_master_loopback.c sends DEMO_TDM_TX_PATTERN in slots
 * 1-2 with the rest of the frame silent. With 0xFFFF_0000 (high half all ones, low half all
 * zeros) the two orders predict opposite openings:
 *
 *     high half first -> burst OPENS with 16 BCLK high, then low
 *     low  half first -> burst OPENS with 16 BCLK LOW, then high      <-- OBSERVED
 *
 * Observed at 12.5 MHz BCLK: low from the FS edge for ~1.27 us (~16 BCLK), then high 16,
 * low 16, high 16, then silence.
 *
 * It is a SWAP WITHIN EACH SLOT, not a 16-BCLK delay of the whole stream -- the two look
 * identical for one slot, so check the END: the burst finishes ~64 BCLK after the FS edge
 * (~5.17 us), exactly two slots. A global 16-BCLK delay would run to FS+80 and spill into
 * slot 3. FS-to-slot-boundary framing is therefore CORRECT -- see the FS-alignment entry in
 * https://github.com/sulaolab/dspic33ck-hal-lab/blob/main/docs/ck_silicon_findings.md
 * -- and the fault is entirely inside the slot.
 *
 * This is the other half of defect 5, left behind by that fix. Defect 5 forced MODE16, which
 * makes a 32-bit slot two INDEPENDENT wire words ordered by however DMA reads memory; the fix
 * corrected FRMCNT (cadence) and never re-established MSB-first over the pair. Note the
 * hardware cannot be asked to do it: per defect 5, DMACHn.SIZE is ONE BIT (byte or 16-bit
 * word), so a 32-bit DMA element does not exist on this core and MODE32 cannot be DMA-fed.
 *
 * No swap is applied in THIS function, and none should be: the fix is the buffer's element
 * type (see above and nora_tdm_slot_t). The alternatives considered and rejected
 * were a swap pass in the HAL around the block callback (3-4x the cost, since it cannot fold
 * into a store the DSP is already doing) and declaring low-half-first the contract (pushes a
 * transport detail into audio code).
 *
 * HISTORY, and it is the instructive part. This block previously read "SETTLED: the HALFWORD
 * ORDER within a slot (scope, EV88G73A, 2026-07-30)" and asserted the HIGH half goes first
 * with "no half-word swap needed anywhere". That is the opposite of what the wire does. Its
 * justification was also unusable on its own terms: it credited "the SPI hardware's own
 * shift-register behaviour, triggered by the SPIxBUFH access", but this code never touches
 * SPIxBUFH -- spi_buf is &SPIxBUFL and is the sole DMA data port -- and its evidence lived in
 * ev88g73a_tdm_master_loopback.c's EV88G73A_TDM_SINE_GAIN_SHIFT/_HIGH_MARKER test, in a
 * board-private demo copy since deleted. **A confident conclusion whose stated mechanism does
 * not occur in the code is worth less than no comment at all**: this one was believed for four
 * days, and on 2026-08-03 it was briefly "re-confirmed" from a trace misattributed to the
 * wrong test pattern before the pattern was checked against the boot banner.
 * See Part 1 of
 * https://github.com/sulaolab/dspic33ck-hal-lab/blob/main/docs/ck_silicon_findings.md.
 */
static bool hw_dma_config_channel( tdm_spi_inst_t inst, nora_dma_channel_t dma_ch, nora_tdm_slot_t *buffer, uint32_t count, bool is_rx )
{
    if( !hw_inst_valid( inst ) )
    {
        return false;
    }

    const tdm_spi_dev_t *dev = &s_spi_dev[inst];

    const nora_dma_channel_cfg_t cfg =
    {
        .src   = is_rx ? dev->spi_buf : (volatile void *)buffer,
        .dst   = is_rx ? (volatile void *)buffer : dev->spi_buf,
        // 32-bit slots as 16-bit DMA half-words. Passed at full width on purpose:
        // dma_channel_config() rejects a count DMACNTn cannot hold, and truncating
        // it here would turn that rejection into a silently short transfer.
        .count = count * 2u,

        .src_mode = is_rx ? NORA_DMA_ADDR_FIXED     : NORA_DMA_ADDR_INCREMENT,
        .dst_mode = is_rx ? NORA_DMA_ADDR_INCREMENT : NORA_DMA_ADDR_FIXED,
        .size     = NORA_DMA_SIZE_HALFWORD,          // 16-bit element (CK core)
        .tr_mode  = NORA_DMA_TRMODE_REPEAT_ONESHOT,

        .reload_count = true,
        .reload_src   = !is_rx,
        .reload_dst   =  is_rx,

        .half_int_en  = true,
        .done_int_en  = true,

        .trigger      = is_rx ? dev->rx_trigger : dev->tx_trigger,

