sulaolab/dspic33ck-hal-lab/src/hal_spi_i2s_tdm/nora_spi_i2s_tdm_dspic33ck_hw.c
        .irq_priority_set = true,
        .irq_priority     = PRIO_TDM_DMA,
        .irq_enable       = is_rx,   // RX raises the block ISR; TX is interrupt-less
    };

    if( !nora_dma_channel_config(dma_ch, &cfg) )
    {
        TDM_DBG_PRINTF(" ERROR: DMA ch%u config failed (DMA not ready?).\n", (unsigned)dma_ch);
        return false;
    }
    if( !nora_dma_channel_enable(dma_ch, true) )
    {
        TDM_DBG_PRINTF(" ERROR: DMA ch%u enable failed (DMA not ready?).\n", (unsigned)dma_ch);
        return false;
    }
    return true;
}


static void hw_spi_irq_enable( tdm_spi_inst_t inst, bool enable )
{
    if( !hw_inst_valid( inst ) )
    {
        return;
    }

    hw_spi_irq_bits_enable( inst, enable );
}


static void hw_spi_irq_disable_clear( tdm_spi_inst_t inst )
{
    hw_spi_irq_enable( inst, false );
    nora_spi_i2s_tdm_hw_irq_clear_flags( inst );
}


/*
 * The CPU-side RX/TX enable and flag bits, written one bit at a time.
 *
 * Every write below names its register and its bit at compile time and stores a literal,
 * so each one is a single bset.b / bclr.b on the shared word. The if/else is what makes
 * that true: `_SPI1RXIE = enable` hands the compiler a runtime value, and while dsPIC33C
 * has BFINS to fold that into one instruction, nothing in the C says so -- the same line
 * is a read-modify-write on dsPIC33A, where there is no BFINS.
 *
 * A part that has an SPI module whose interrupt bits the DFP does not name must fail to
 * build rather than silently ship a transport that cannot arm or clear its own interrupt.
 */
#if defined(SPI1CON1L) && !(defined(_SPI1RXIE) && defined(_SPI1TXIE) && \
                            defined(_SPI1RXIF) && defined(_SPI1TXIF))
#error "SPI1 is present but the DFP names no _SPI1RX/TXIE / _SPI1RX/TXIF bit alias"
#endif
#if defined(SPI2CON1L) && !(defined(_SPI2RXIE) && defined(_SPI2TXIE) && \
                            defined(_SPI2RXIF) && defined(_SPI2TXIF))
#error "SPI2 is present but the DFP names no _SPI2RX/TXIE / _SPI2RX/TXIF bit alias"
#endif
#if defined(SPI3CON1L) && !(defined(_SPI3RXIE) && defined(_SPI3TXIE) && \
                            defined(_SPI3RXIF) && defined(_SPI3TXIF))
#error "SPI3 is present but the DFP names no _SPI3RX/TXIE / _SPI3RX/TXIF bit alias"
#endif

static void hw_spi_irq_bits_enable( tdm_spi_inst_t inst, bool enable )
{
    if( enable )
    {
        switch( inst )
        {
        case TDM_SPI1: _SPI1RXIE = 1; _SPI1TXIE = 1; break;
        case TDM_SPI2: _SPI2RXIE = 1; _SPI2TXIE = 1; break;
#if defined(SPI3CON1L)
        case TDM_SPI3: _SPI3RXIE = 1; _SPI3TXIE = 1; break;
#endif
        default: break;
        }
    }
    else
    {
        switch( inst )
        {
        case TDM_SPI1: _SPI1RXIE = 0; _SPI1TXIE = 0; break;
        case TDM_SPI2: _SPI2RXIE = 0; _SPI2TXIE = 0; break;
#if defined(SPI3CON1L)
        case TDM_SPI3: _SPI3RXIE = 0; _SPI3TXIE = 0; break;
#endif
        default: break;
        }
    }
}


static void hw_spi_irq_bits_clear_flags( tdm_spi_inst_t inst )
{
    switch( inst )
    {
    case TDM_SPI1: _SPI1RXIF = 0; _SPI1TXIF = 0; break;
    case TDM_SPI2: _SPI2RXIF = 0; _SPI2TXIF = 0; break;
#if defined(SPI3CON1L)
    case TDM_SPI3: _SPI3RXIF = 0; _SPI3TXIF = 0; break;
#endif
    default: break;
    }
}
